---
kind: property
id: P:Autodesk.Revit.DB.Material.Color
zh: 着色、上色、染色、填色
source: html/0c6c0bd9-15db-d839-786d-b33d18311017.htm
---
# Autodesk.Revit.DB.Material.Color Property

**中文**: 着色、上色、染色、填色

The color of the material.

## Syntax (C#)
```csharp
public Color Color { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null